app/controllers/movies_controller.rb

    def index
      sort = params[:sort] || session[:sort]

      @all_ratings = Movie.all_ratings
      @ratings_to_show = params[:ratings] || session[:ratings] || {}

      if @ratings_to_show == {}
        @ratings_to_show = Hash[@all_ratings.map {|rating| [rating, 1]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17')  ORDER BY release_date